import numpy as np 
import matplotlib.pyplot as plt
import cv2
from PIL  import Image

### 出力
"""

"""

######### 画像読み込み
imgRead = Image.open("sample1.png")
### 表示
plt.imshow(imgRead)
plt.show()

######### 画像を配列へ
img_array = np.array(imgRead)
img_array

### 出力
""" 
array([[[240, 239, 234],
        [239, 236, 233],
        [241, 240, 233],
        ...,
        [189, 176, 160],
        [188, 178, 163],
        [187, 176, 158]],

       [[242, 243, 234],
        [240, 242, 234],
        [242, 237, 232],
        ...,
        [188, 178, 163],
        [188, 178, 161],
        [185, 177, 161]],

       [[240, 240, 236],
        [241, 239, 233],
        [242, 237, 233],
        ...,
        [187, 179, 161],
        [187, 175, 156],
        [185, 177, 161]],

       ...,

       [[144, 113,  92],
        [135, 112,  86],
        [147, 119,  92],
        ...,
        [113,  73,  27],
        [113,  74,  33],
        [111,  69,  26]],

       [[143, 112,  87],
        [144, 115,  93],
        [157, 121,  99],
        ...,
        [117,  73,  26],
        [118,  77,  27],
        [115,  70,  32]],

       [[141, 111,  83],
        [138, 114,  87],
        [144, 120,  95],
        ...,
        [120,  66,  25],
        [121,  70,  25],
        [120,  68,  27]]], dtype=uint8)

"""

######### 配列の要素
img_array.shape
### 出力　　、　高さ, 幅, チャンネル
"""
(1024, 1536, 3)
"""

imgRead.mode
### 出力
"""
RGB
"""

###############################################
################################ フィルタリング
###############################################

################################
############## ガウシアンフィルタ
################################
blurred_img = cv2.GaussianBlur(img_array, (41,41), 0)
blurred_img

# 現画像　表示
plt.subplot(1 ,2, 1)
plt.imshow(imgRead)

# フィルタ画像 表示
plt.subplot(1, 2, 2)
plt.imshow(blurred_img)

################################
############## メジアンフィルタ
################################
median_blurred_img = cv2.medianBlur(img_array, 51)

# 現画像　表示
plt.subplot(1 ,2, 1)
plt.imshow(imgRead)

plt.subplot(1,2,2)
plt.imshow(median_blurred_img)